RhinoInside.Revit API Documentation
GeometryDecoder.ToCurve Method (HermiteSpline)
 Converts the specified HermiteSpline to an equivalent Rhino Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Rhino.Geometry.Curve ToCurve(
	this Autodesk.Revit.DB.HermiteSpline value
)
@staticmethod
def ToCurve(
	value: Autodesk.Revit.DB.HermiteSpline
) -> Rhino.Geometry.Curve
Parameters
value
Type: Autodesk.Revit.DB.HermiteSpline
A value to convert.
Return Value
Type: Rhino.Geometry.Curve
A Rhino Curve that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.HermiteSpline. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace